src/DataProcessors/бпсСтатусыСогласований.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<DataProcessor>
		<Properties>
			<Name>бпсСтатусыСогласований</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипОбъектаБД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бпсТипыОбъектовБД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредметСогласования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бпсПредметыСогласований</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектБД</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/InformationRegisters/бпсСтатусыОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<InformationRegister>
		<Properties>
			<Name>бпсСтатусыОбъектов</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бпсСтатусыОбъектов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:BusinessProcessRef.бпсСогласование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ОбъектБД</Name>
					<Type>
						<v8:Type>cfg:BusinessProcessRef.бпсСогласование</v8:Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПредметСогласования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бпсПредметыСогласований</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/бпсБизнесПроцессыСогласования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<InformationRegister>
		<Properties>
			<Name>бпсБизнесПроцессыСогласования</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Согласование</Name>
					<Type>
						<v8:Type>cfg:BusinessProcessRef.бпсСогласование</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПредметСогласования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бпсПредметыСогласований</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектБД</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Catalogs/бпсТипыОбъектовБД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Catalog>
		<Properties>
			<Name>бпсТипыОбъектовБД</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОбъектБДСиноним</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектБДИмяМетаданных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МенеджерОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МенеджерОбъектаДляЗапроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/DataProcessors/бпсСтатусыСогласований/Ext/ObjectModule.bsl
Функция ПолучитьНастройкиДляСписка() Экспорт 
	ТекстЗапроса = Неопределено;
	ОсновнаяТаблица = Неопределено;
	
	РезультатФункции = Новый Структура();
	РезультатФункции.Вставить("ТекстЗапроса",ТекстЗапроса);
	РезультатФункции.Вставить("ОсновнаяТаблица",ОсновнаяТаблица);	
	
	Если НЕ ЗначениеЗаполнено(ТипОбъектаБД) Тогда
		Возврат РезультатФункции;
	Конецесли;
	
	пЭтоСправочникИерархический = Справочники.бпсТипыОбъектовБД.ЭтоСправочникИерархический(ТипОбъектаБД);
	
	ОсновнаяТаблица = ""+ТипОбъектаБД.МенеджерОбъектаДляЗапроса+"."+ТипОбъектаБД.ОбъектБДИмяМетаданных+"";
	
	ТекстЗапроса = ПолучитьТекстЗапроса(ОсновнаяТаблица,пЭтоСправочникИерархический);
	
	РезультатФункции.Вставить("ТекстЗапроса",ТекстЗапроса);
	РезультатФункции.Вставить("ОсновнаяТаблица",ОсновнаяТаблица);
	
	Возврат РезультатФункции;
КонецФункции //ПолучитьНастройкиДляСписка()

Функция ПолучитьТекстЗапроса(ОсновнаяТаблица,пЭтоСправочникИерархический) 
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ОбъектыБД.Ссылка,
	|" 
	+ ?(пЭтоСправочникИерархический,"
	|	ВЫБОР КОГДА ОбъектыБД.Ссылка.ЭтоГруппа ТОГДА
	|		НЕОПРЕДЕЛЕНО
	|	ИНАЧЕ
	|   	ЕСТЬNULL(бпсСтатусыОбъектовСрезПоследних.Статус,ЗНАЧЕНИЕ(Справочник.бпсСтатусыОбъектов.Согласование_НеУтверждено))
	|	КОНЕЦ КАК Статус,"
	,"
	|	ЕСТЬNULL(бпсСтатусыОбъектовСрезПоследних.Статус,ЗНАЧЕНИЕ(Справочник.бпсСтатусыОбъектов.Согласование_НеУтверждено)) КАК Статус,"
	)+"
	|	бпсБизнесПроцессыСогласованияСрезПоследних.Согласование
	|ИЗ
	|	"+ОсновнаяТаблица+" КАК ОбъектыБД
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бпсСтатусыОбъектов.СрезПоследних(
	|				,
	|				ВЫБОР
	|					КОГДА &ПредметСогласованияЗаполнен
	|						ТОГДА ПредметСогласования = &ПредметСогласования
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ) КАК бпсСтатусыОбъектовСрезПоследних
	|		ПО ОбъектыБД.Ссылка = бпсСтатусыОбъектовСрезПоследних.ОбъектБД
	|			И (&ПредметСогласованияЗаполнен)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бпсБизнесПроцессыСогласования.СрезПоследних(
	|				,
	|				ВЫБОР
	|					КОГДА &ПредметСогласованияЗаполнен
	|						ТОГДА ПредметСогласования = &ПредметСогласования
	|					ИНАЧЕ ЛОЖЬ
	|				КОНЕЦ) КАК бпсБизнесПроцессыСогласованияСрезПоследних
	|		ПО ОбъектыБД.Ссылка = бпсБизнесПроцессыСогласованияСрезПоследних.ОбъектБД
	|			И (&ПредметСогласованияЗаполнен)
	|ГДЕ
	|	ИСТИНА
	|	И ВЫБОР КОГДА &ИспользоватьОтборПоОбъектуБД ТОГДА
	|		ОбъектыБД.Ссылка = &ОбъектБД	
	|	ИНАЧЕ
	| 		ИСТИНА
	|	КОНЕЦ
	|";
	Возврат ТекстЗапроса;
КонецФункции //ПолучитьТекстЗапроса()
